espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/syscon_reg.h
/** SYSCON_PERI_BACKUP_REG_MAP3_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_REG_MAP3_REG (DR_REG_SYSCON_BASE + 0xcc)
/** SYSCON_PERI_BACKUP_REG_MAP3 : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_REG_MAP3    0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP3_M  (SYSCON_PERI_BACKUP_REG_MAP3_V << SYSCON_PERI_BACKUP_REG_MAP3_S)
#define SYSCON_PERI_BACKUP_REG_MAP3_V  0xFFFFFFFFU
#define SYSCON_PERI_BACKUP_REG_MAP3_S  0

/** SYSCON_PERI_BACKUP_INT_RAW_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_INT_RAW_REG (DR_REG_SYSCON_BASE + 0xd0)
/** SYSCON_PERI_BACKUP_DONE_INT_RAW : RO; bitpos: [0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_DONE_INT_RAW    (BIT(0))
#define SYSCON_PERI_BACKUP_DONE_INT_RAW_M  (SYSCON_PERI_BACKUP_DONE_INT_RAW_V << SYSCON_PERI_BACKUP_DONE_INT_RAW_S)
#define SYSCON_PERI_BACKUP_DONE_INT_RAW_V  0x00000001U
#define SYSCON_PERI_BACKUP_DONE_INT_RAW_S  0
/** SYSCON_PERI_BACKUP_ERR_INT_RAW : RO; bitpos: [1]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_ERR_INT_RAW    (BIT(1))
#define SYSCON_PERI_BACKUP_ERR_INT_RAW_M  (SYSCON_PERI_BACKUP_ERR_INT_RAW_V << SYSCON_PERI_BACKUP_ERR_INT_RAW_S)
#define SYSCON_PERI_BACKUP_ERR_INT_RAW_V  0x00000001U
#define SYSCON_PERI_BACKUP_ERR_INT_RAW_S  1

/** SYSCON_PERI_BACKUP_INT_ST_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_INT_ST_REG (DR_REG_SYSCON_BASE + 0xd4)
/** SYSCON_PERI_BACKUP_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_DONE_INT_ST    (BIT(0))
#define SYSCON_PERI_BACKUP_DONE_INT_ST_M  (SYSCON_PERI_BACKUP_DONE_INT_ST_V << SYSCON_PERI_BACKUP_DONE_INT_ST_S)
#define SYSCON_PERI_BACKUP_DONE_INT_ST_V  0x00000001U
#define SYSCON_PERI_BACKUP_DONE_INT_ST_S  0
/** SYSCON_PERI_BACKUP_ERR_INT_ST : RO; bitpos: [1]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_ERR_INT_ST    (BIT(1))
#define SYSCON_PERI_BACKUP_ERR_INT_ST_M  (SYSCON_PERI_BACKUP_ERR_INT_ST_V << SYSCON_PERI_BACKUP_ERR_INT_ST_S)
#define SYSCON_PERI_BACKUP_ERR_INT_ST_V  0x00000001U
#define SYSCON_PERI_BACKUP_ERR_INT_ST_S  1

/** SYSCON_PERI_BACKUP_INT_ENA_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_INT_ENA_REG (DR_REG_SYSCON_BASE + 0xd8)
/** SYSCON_PERI_BACKUP_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_DONE_INT_ENA    (BIT(0))
#define SYSCON_PERI_BACKUP_DONE_INT_ENA_M  (SYSCON_PERI_BACKUP_DONE_INT_ENA_V << SYSCON_PERI_BACKUP_DONE_INT_ENA_S)
#define SYSCON_PERI_BACKUP_DONE_INT_ENA_V  0x00000001U
#define SYSCON_PERI_BACKUP_DONE_INT_ENA_S  0
/** SYSCON_PERI_BACKUP_ERR_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_ERR_INT_ENA    (BIT(1))
#define SYSCON_PERI_BACKUP_ERR_INT_ENA_M  (SYSCON_PERI_BACKUP_ERR_INT_ENA_V << SYSCON_PERI_BACKUP_ERR_INT_ENA_S)
#define SYSCON_PERI_BACKUP_ERR_INT_ENA_V  0x00000001U
#define SYSCON_PERI_BACKUP_ERR_INT_ENA_S  1

/** SYSCON_PERI_BACKUP_INT_CLR_REG register
 *  register description
 */
#define SYSCON_PERI_BACKUP_INT_CLR_REG (DR_REG_SYSCON_BASE + 0xdc)
/** SYSCON_PERI_BACKUP_DONE_INT_CLR : WO; bitpos: [0]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_DONE_INT_CLR    (BIT(0))
#define SYSCON_PERI_BACKUP_DONE_INT_CLR_M  (SYSCON_PERI_BACKUP_DONE_INT_CLR_V << SYSCON_PERI_BACKUP_DONE_INT_CLR_S)
#define SYSCON_PERI_BACKUP_DONE_INT_CLR_V  0x00000001U
#define SYSCON_PERI_BACKUP_DONE_INT_CLR_S  0
/** SYSCON_PERI_BACKUP_ERR_INT_CLR : WO; bitpos: [1]; default: 0;
 *  Need add description
 */
#define SYSCON_PERI_BACKUP_ERR_INT_CLR    (BIT(1))
#define SYSCON_PERI_BACKUP_ERR_INT_CLR_M  (SYSCON_PERI_BACKUP_ERR_INT_CLR_V << SYSCON_PERI_BACKUP_ERR_INT_CLR_S)
#define SYSCON_PERI_BACKUP_ERR_INT_CLR_V  0x00000001U
#define SYSCON_PERI_BACKUP_ERR_INT_CLR_S  1

/** SYSCON_SYSCON_REGCLK_CONF_REG register
 *  register description
 */
#define SYSCON_SYSCON_REGCLK_CONF_REG (DR_REG_SYSCON_BASE + 0xe0)
/** SYSCON_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Need add description
 */
#define SYSCON_CLK_EN    (BIT(0))
#define SYSCON_CLK_EN_M  (SYSCON_CLK_EN_V << SYSCON_CLK_EN_S)
#define SYSCON_CLK_EN_V  0x00000001U
#define SYSCON_CLK_EN_S  0

/** SYSCON_SYSCON_DATE_REG register
 *  register description
 */
#define SYSCON_SYSCON_DATE_REG (DR_REG_SYSCON_BASE + 0x3fc)
/** SYSCON_SYSCON_DATE : R/W; bitpos: [31:0]; default: 34607184;
 *  Version control
 */
#define SYSCON_SYSCON_DATE    0xFFFFFFFFU
#define SYSCON_SYSCON_DATE_M  (SYSCON_SYSCON_DATE_V << SYSCON_SYSCON_DATE_S)
#define SYSCON_SYSCON_DATE_V  0xFFFFFFFFU
#define SYSCON_SYSCON_DATE_S  0

#ifdef __cplusplus
}
#endif
